# MENGHAPUS(DROP) MISSING VALUES MISSING VALUES(NaN)

## Import Modules ###

In [1]:
import pandas as pd

print (pd.__version__)

1.3.4

# Persiapan Data Frame ##

In [4]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  rxASTuobzE -0.950649       NaN  0.045900 -1.518131
1  FQCel9Vd4k -0.191583 -0.333996 -0.071711  0.186834
2  mphG83MCXD  0.463929  1.956087  0.086926 -0.452871
3  jYZPEuEWOx       NaN -1.156312       NaN  0.700853
4  y1X4QR53ty       NaN  0.363318 -0.327789 -0.536000

## Mengubah Nama Kolom Index ##

In [5]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  rxASTuobzE -0.950649       NaN  0.045900 -1.518131
1  FQCel9Vd4k -0.191583 -0.333996 -0.071711  0.186834
2  mphG83MCXD  0.463929  1.956087  0.086926 -0.452871
3  jYZPEuEWOx       NaN -1.156312       NaN  0.700853
4  y1X4QR53ty       NaN  0.363318 -0.327789 -0.536000

In [7]:
df_backup = df.copy(deep=True)

Membuat copy yang akan di simpang ke dalam df_backup

### Menghapus(drop) Setiap Kolom Yang Mengandung Missing Values ###

In [8]:
df = df.dropna(axis='columns')
df.head()

            Z
0  rxASTuobzE
1  FQCel9Vd4k
2  mphG83MCXD
3  jYZPEuEWOx
4  y1X4QR53ty

### Menghapus(drop) Setiap Baris Yang Mengandung Missing Values ###

In [10]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
1  FQCel9Vd4k -0.191583 -0.333996 -0.071711  0.186834
2  mphG83MCXD  0.463929  1.956087  0.086926 -0.452871
6  s0fnNuHhDd  1.554719 -0.895641 -0.578655 -0.085036
8  zSvcwVnQOI -0.143368  0.177799 -0.465076 -0.431961
9  eoGFKjh0hT -0.736569 -0.358036  0.553238  0.824484

### Presentase Missing Values Untuk Tiap Kolom ###

In [13]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.133333
B    0.066667
C    0.066667
D    0.133333
dtype: float64

### Menghapus(drop) Setiap Kolom Yang Mengandung Missing Values Berdasarkan Threshold

In [16]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         B         C
0  rxASTuobzE       NaN  0.045900
1  FQCel9Vd4k -0.333996 -0.071711
2  mphG83MCXD  1.956087  0.086926
3  jYZPEuEWOx -1.156312       NaN
4  y1X4QR53ty  0.363318 -0.327789